Revit 2026 API

# RevitAPIPreEventArgsCancel Method

---

When the event is cancellable, may call the Cancel() method to cancel it.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Cancel()
```
```vb
Public Sub Cancel
```
```cpp
public:
void Cancel()
```
```fsharp
member Cancel : unit -> unit
```

Not every event is cancellable. Whether or not an event may be cancelled is indicated by IsCancellable() method.

#### Reference

RevitAPIPreEventArgs Class

Autodesk.Revit.DB.Events Namespace